In [5]:
import pandas as pd

In [6]:
label = ['a', 'b', 'c', 'd', 'e']
data = [1, 2, 3, 4, 5]
s = pd.Series(data, index=label)

In [8]:
data = {'col1': [1, 2, 3, 4, 5], 'col2': [2, 3, 4, 5, 6], 'col3': [3, 4, 5, 6, 7]}
index_name = ['zero', 'one', 'two', 'three', 'four']
df = pd.DataFrame(data, index=index_name)

In [9]:
df.loc['one', 'col2']

3

In [10]:
df.loc['one': 'three', :]

       col1  col2  col3
one       2     3     4
two       3     4     5
three     4     5     6

In [11]:
df.loc[['one', 'four'], ['col1', 'col3']]

      col1  col3
one      2     4
four     5     7

In [12]:
s.loc['b']

2

In [15]:
df.iloc[1,1]

3

In [16]:
df.iloc[1:4, :]

       col1  col2  col3
one       2     3     4
two       3     4     5
three     4     5     6

In [17]:
df.iloc[[1, 4], [0, 2]]

      col1  col3
one      2     4
four     5     7

In [18]:
s.iloc[1]

2

In [19]:
df['col2']

zero     2
one      3
two      4
three    5
four     6
Name: col2, dtype: int64

In [21]:
df[['col1', 'col3']]

       col1  col3
zero      1     3
one       2     4
two       3     5
three     4     6
four      5     7

In [22]:
s['b']

2

In [23]:
df.iloc[1, 1] = 111

In [24]:
df.iloc[1,1]

111

In [25]:
df.iloc[1:4, :] = [13, 14, 15]

In [26]:
df.iloc[:, 2]=0

In [27]:
df.iloc[[1, 4], [0, 2]]

      col1  col3
one     13     0
four     5     0

In [28]:
df.iloc[1:4, :]

       col1  col2  col3
one      13    14     0
two      13    14     0
three    13    14     0

In [31]:
df

       col1  col2  col3
zero      1     2     0
one      13    14     0
two      13    14     0
three    13    14     0
four      5     6     0
5        42    42    42

In [30]:
df.loc[5] = 42

In [32]:
df[4] = 4

In [33]:
df

       col1  col2  col3  4
zero      1     2     0  4
one      13    14     0  4
two      13    14     0  4
three    13    14     0  4
four      5     6     0  4
5        42    42    42  4

In [35]:
csv_url = 'https://www.customs.go.jp/toukei/shinbun/trade-st/timeseries_202003.csv'
df = pd.read_csv(csv_url, index_col=0, encoding='shift-jis')
print(df.head())
df.to_csv('data/boueki.csv')

                                         Unnamed: 1 Unnamed: 2
《季節調整値》　（単位：百万円）
Seasonally adjusted data (a million yen)        NaN        NaN
Years/Months                              Exp-Total  Imp-Total
NaN                                             NaN        NaN
2010/04                                     5624812    5045774
2010/05                                     5644861    5167155

In [37]:
excel_url = 'https://www.mof.go.jp/budget/reference/statistics/01.xls'
excel = pd.ExcelFile(excel_url)
print(excel.sheet_names)
print(len(excel.sheet_names))
df = pd.ExcelFile.parse(excel, sheet_name=excel.sheet_names[3], index_col=0)
df.to_excel('data/zaimu.xls')
print(df.head())

WARNING *** file size (193488) not 512 + multiple of sector size (512)
['1.-1明治・大正', '1.-2昭和元～21年度', '1.-3昭和22～63年度', '1.-4平成', '1.-5令和']
5
    Unnamed: 1    Unnamed: 2 Unnamed: 3    Unnamed: 4 Unnamed: 5 Unnamed: 6  \
年度       区　　 分  歳　　　　　　　　　　入        NaN  歳　　　　　　　　　　出        NaN  備　　　　　　　考
NaN        NaN       予　　算　　額    決　　算　　額       予　　算　　額    決　　算　　額        NaN
NaN        NaN           NaN        NaN           NaN        NaN        NaN
平成        暫定予算           NaN        NaN           NaN        NaN        NaN
元年度    　第114国会    2843097334        NaN    9224545254        NaN        NaN

         （単位：千円）
年度         備　　　考
NaN          NaN
NaN          NaN
平成           NaN
元年度  4月1日～5月20日分

In [39]:
html_url = 'http://www.kantei.go.jp/jp/singi/keizaisaisei/miraitoshikaigi/suishinkaigo2018/'
df = pd.read_html(html_url)[5]
print(df.head())

    回数         開催日                                       議題・会議資料関係
0  第6回  令和元年11月25日  組織の変革とオープンイノベーションの推進―内部の経営資源の新たな分野への投資の促進に向けて―
1  第6回  令和元年11月25日                                  議事次第 配布資料 議事要旨
2  第5回  令和元年10月31日  組織の変革とオープンイノベーションの推進―内部の経営資源の新たな分野への投資の促進に向けて―
3  第5回  令和元年10月31日                                  議事次第 配布資料 議事要旨
4  第4回   平成31年4月5日                           産学融合によるイノベーションの創出について